In [3]:
import requests
import pandas as pd
import json

In [4]:
r = requests.get('https://collectionapi.metmuseum.org/public/collection/v1/departments')

creating a variable to store the data

In [5]:
art_data = r.json()

In [17]:
df = pd.DataFrame(art_data)

In [18]:
df.head()

                                         departments
0  {'departmentId': 1, 'displayName': 'American D...
1  {'departmentId': 3, 'displayName': 'Ancient Ne...
2  {'departmentId': 4, 'displayName': 'Arms and A...
3  {'departmentId': 5, 'displayName': 'Arts of Af...
4    {'departmentId': 6, 'displayName': 'Asian Art'}

In [19]:
df.describe()

                                              departments
count                                                  19
unique                                                 19
top     {'departmentId': 1, 'displayName': 'American D...
freq                                                    1

We have 19 unique departments to pull data from. What are they?

In [20]:
print (df)

                                          departments
0   {'departmentId': 1, 'displayName': 'American D...
1   {'departmentId': 3, 'displayName': 'Ancient Ne...
2   {'departmentId': 4, 'displayName': 'Arms and A...
3   {'departmentId': 5, 'displayName': 'Arts of Af...
4     {'departmentId': 6, 'displayName': 'Asian Art'}
5   {'departmentId': 7, 'displayName': 'The Cloist...
6   {'departmentId': 8, 'displayName': 'The Costum...
7   {'departmentId': 9, 'displayName': 'Drawings a...
8   {'departmentId': 10, 'displayName': 'Egyptian ...
9   {'departmentId': 11, 'displayName': 'European ...
10  {'departmentId': 12, 'displayName': 'European ...
11  {'departmentId': 13, 'displayName': 'Greek and...
12  {'departmentId': 14, 'displayName': 'Islamic A...
13  {'departmentId': 15, 'displayName': 'The Rober...
14  {'departmentId': 16, 'displayName': 'The Libra...
15  {'departmentId': 17, 'displayName': 'Medieval ...
16  {'departmentId': 18, 'displayName': 'Musical I...
17  {'departmentId': 19, 'displayName': 'Photograp...
18  {'departmentId': 21, 'displayName': 'Modern Art'}

Okay. I think I want to work with a specific collection next. Medieval Art sounds interesting. Department ID #17. Let's pull that one next.

In [22]:
r2 = requests.get('https://collectionapi.metmuseum.org/public/collection/v1/objects?departmentIds=17')

In [23]:
art_data2=r2.json()

Create another variable to store this new df.

In [24]:
df2 = pd.DataFrame(art_data2)

Let's see what we have to work with.

In [25]:
df2.head()

   total  objectIDs
0   7142      32830
1   7142      32831
2   7142      32832
3   7142      32833
4   7142      32834

There are 7142 items in this collection.

In [27]:
df2.tail()

      total  objectIDs
7137   7142     812958
7138   7142     812961
7139   7142     812963
7140   7142     812964
7141   7142     812965

Let's pull info on a random object in this collection.

In [28]:
r3=requests.get('https://collectionapi.metmuseum.org/public/collection/v1/objects/812961')

In [30]:
object_data=r3.json()

What info is available for this random object?

In [31]:
print(object_data)

{'objectID': 812961, 'isHighlight': False, 'accessionNumber': '2018.913.5', 'accessionYear': '2018', 'isPublicDomain': True, 'primaryImage': 'https://images.metmuseum.org/CRDImages/md/original/LC_TR_311_6_2018-s01.jpg', 'primaryImageSmall': 'https://images.metmuseum.org/CRDImages/md/web-large/LC_TR_311_6_2018-s01.jpg', 'additionalImages': [], 'constituents': None, 'department': 'Medieval Art', 'objectName': 'Textile', 'title': 'Wool Roundel with Mythological Animal', 'culture': 'Egyptian', 'period': '', 'dynasty': '', 'reign': '', 'portfolio': '', 'artistRole': '', 'artistPrefix': '', 'artistDisplayName': '', 'artistDisplayBio': '', 'artistSuffix': '', 'artistAlphaSort': '', 'artistNationality': '', 'artistBeginDate': '', 'artistEndDate': '', 'artistGender': '', 'artistWikidata_URL': '', 'artistULAN_URL': '', 'objectDate': '7th–9th century', 'objectBeginDate': 600, 'objectEndDate': 900, 'medium': 'Polychrome wool and undyed linen; tapestry weave', 'dimensions': '8 3/8 × 5 3/16 in. (21.3 × 13.1 cm)\r\nMount: 11 5/8 × 8 1/16 × 1 3/16 in. (29.5 × 20.4 × 3 cm)', 'measurements': [{'elementName': 'Overall', 'elementDescription': None, 'elementMeasurements': {'Height': 21.3, 'Width': 13.1}}, {'elementName': 'Mount', 'elementDescription': None, 'elementMeasurements': {'Depth': 3, 'Height': 29.5, 'Width': 20.4}}], 'creditLine': 'Gift of Dr. Marilyn Jenkins-Madina, in loving memory of her husband, Professor Maan Z. Madina, 2018', 'geographyType': '', 'city': '', 'state': '', 'county': '', 'country': '', 'region': '', 'subregion': '', 'locale': '', 'locus': '', 'excavation': '', 'river': '', 'classification': 'Textiles-Woven', 'rightsAndReproduction': '', 'linkResource': '', 'metadataDate': '2020-03-31T04:44:12.95Z', 'repository': 'Metropolitan Museum of Art, New York, NY', 'objectURL': 'https://www.metmuseum.org/art/collection/search/812961', 'tags': None, 'objectWikidata_URL': '', 'isTimelineWork': False, 'GalleryNumber': ''}

How do I see all the objects listed as 'Egyptian' culture within the Medieval Art dataset?